"use client";

import { useRef, type FC, useState, useEffect } from "react";
import styles from "./avatarEditAccount.module.css"; // Подключаем стили
import type { AvatarEditAccountProps } from "./type";
import UserCircle from "../../assets/user-circle75x75.svg";

// Компонент AvatarRegistration
export const AvatarEditAccount: FC<AvatarEditAccountProps> = ({
  onImageChange,
  initialAvatarUrl,
}) => {
  // стейт для файла авы
  const [avatarForForm, setAvatarForForm] = useState<File | null>(null);

  // стейт для адерса картинки
  // если переменная пустая, будет свг картинка, если есть адрес, появится картинка
  const [srcAvatar, setSrcAvatar] = useState<string | null>(
    initialAvatarUrl ?? null,
  );

  const inputHiddenAccount = useRef<HTMLInputElement>(null);

  // здесь должен быть задействован селектор, который получает ссылку на автарку из слайса личных данных, или личного кабинета.
  useEffect(() => {
    if (initialAvatarUrl) {
      setSrcAvatar(initialAvatarUrl);
    }
  }, [initialAvatarUrl]);

  const handleClick = () => {
    if (inputHiddenAccount.current !== null) {
      inputHiddenAccount.current.click();
    }
  };

  const handleOnChange = (event: React.ChangeEvent<HTMLInputElement>) => {
    const inputFiles = event.target.files;

    if (!inputFiles || !inputFiles.length) return; // Проверяем наличие файлов

    const newAvatar = inputFiles[0];

    if (newAvatar) {
      const src = URL.createObjectURL(newAvatar);
      setSrcAvatar(src);
      setAvatarForForm(newAvatar);
      onImageChange(newAvatar);
    }
  };

  return (
    <div className={styles.container}>
      {/* Поле для загрузки аватара */}
      <input
        ref={inputHiddenAccount}
        id="inputHiddenAccount"
        data-cy="inputHiddenAccount"
        type="file"
        className={styles.inputAvatar}
        accept="image/*"
        onChange={handleOnChange}
      />

      {srcAvatar ? (
        <img src={srcAvatar} className={styles.imageAvatar} />
      ) : (
        <svg
          className={styles.noAvatar}
          viewBox="0 0 56 56"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M45.946 48.1741C43.8494 45.3991 41.1373 43.1486 38.0232 41.5999C34.9091 40.0511 31.478 39.2464 28 39.2491C24.522 39.2464 21.0909 40.0511 17.9767 41.5999C14.8626 43.1486 12.1505 45.3991 10.054 48.1741M45.946 48.1741C50.0365 44.5357 52.9243 39.7398 54.2265 34.4224C55.5287 29.105 55.1838 23.5174 53.2374 18.4005C51.291 13.2837 47.8351 8.87944 43.3282 5.77181C38.8212 2.66417 33.476 1 28.0015 1C22.527 1 17.1818 2.66417 12.6748 5.77181C8.16779 8.87944 4.71196 13.2837 2.76557 18.4005C0.819189 23.5174 0.474224 29.105 1.77643 34.4224C3.07863 39.7398 5.96347 44.5357 10.054 48.1741M45.946 48.1741C41.0074 52.5777 34.6166 55.0074 28 54.9991C21.3823 55.0081 14.9933 52.5784 10.054 48.1741M37 21.2491C37 23.6361 36.0518 25.9253 34.3639 27.6131C32.6761 29.3009 30.3869 30.2491 28 30.2491C25.613 30.2491 23.3238 29.3009 21.636 27.6131C19.9482 25.9253 19 23.6361 19 21.2491C19 18.8622 19.9482 16.573 21.636 14.8852C23.3238 13.1973 25.613 12.2491 28 12.2491C30.3869 12.2491 32.6761 13.1973 34.3639 14.8852C36.0518 16.573 37 18.8622 37 21.2491Z"
            stroke-width="1.5"
            stroke-linecap="round"
            stroke-linejoin="round"
          />
        </svg>
      )}
      <span className={styles.addCircle} onClick={handleClick}>
        <svg
          className={styles.editAvatar}
          viewBox="0 0 24 24"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M9.2079 10.8396C7.79429 10.8396 6.65039 9.69572 6.65039 8.28212C6.65039 6.86851 7.79429 5.72461 9.2079 5.72461C10.6215 5.72461 11.7654 6.86851 11.7654 8.28212C11.7654 9.69572 10.6215 10.8396 9.2079 10.8396ZM9.2079 7.11961C8.5662 7.11961 8.0454 7.64042 8.0454 8.28212C8.0454 8.92382 8.5662 9.44462 9.2079 9.44462C9.8496 9.44462 10.3704 8.92382 10.3704 8.28212C10.3704 7.64042 9.8496 7.11961 9.2079 7.11961Z"
            fill="var(--text-color)"
          />
          <path
            d="M14.7875 22.0009H9.20752C4.15761 22.0009 2 19.8433 2 14.7934V9.21338C2 4.16347 4.15761 2.00586 9.20752 2.00586H12.9275C13.3088 2.00586 13.625 2.32206 13.625 2.70336C13.625 3.08466 13.3088 3.40086 12.9275 3.40086H9.20752C4.92021 3.40086 3.395 4.92607 3.395 9.21338V14.7934C3.395 19.0807 4.92021 20.6059 9.20752 20.6059H14.7875C19.0749 20.6059 20.6001 19.0807 20.6001 14.7934V10.1434C20.6001 9.76208 20.9163 9.44588 21.2976 9.44588C21.6789 9.44588 21.9951 9.76208 21.9951 10.1434V14.7934C21.9951 19.8433 19.8375 22.0009 14.7875 22.0009Z"
            fill="var(--text-color)"
          />
          <path
            d="M15.4096 9.90996C15.0469 9.90996 14.7121 9.77976 14.4703 9.52866C14.182 9.24036 14.0425 8.81256 14.1076 8.37546L14.2936 7.08275C14.3401 6.75725 14.5354 6.35735 14.7772 6.12485L18.1531 2.74894C19.5016 1.40044 20.6734 2.17234 21.25 2.74894C21.7987 3.29764 22.0498 3.87424 21.994 4.46945C21.9475 4.94375 21.7057 5.39945 21.25 5.84585L17.8741 9.22176C17.6416 9.45426 17.2417 9.64956 16.9162 9.70536L15.6235 9.89136C15.5491 9.90996 15.4747 9.90996 15.4096 9.90996ZM19.1296 3.74404L15.7537 7.11995C15.7258 7.14785 15.6793 7.25015 15.67 7.29665L15.4933 8.50566L16.7116 8.33826C16.7488 8.32896 16.8511 8.28246 16.8883 8.24526L20.2642 4.86935C20.4688 4.66475 20.5897 4.47875 20.599 4.33925C20.6176 4.14394 20.4223 3.90214 20.2642 3.74404C19.7806 3.26044 19.5574 3.31624 19.1296 3.74404Z"
            fill="var(--text-color)"
          />
          <path
            d="M20.275 6.54281C20.2099 6.54281 20.1448 6.53351 20.089 6.51491C18.8428 6.16151 17.8477 5.16641 17.4943 3.9202C17.392 3.5482 17.6059 3.1669 17.9779 3.0646C18.3499 2.9623 18.7312 3.1762 18.8335 3.5482C19.0567 4.3294 19.6798 4.9618 20.4703 5.18501C20.8423 5.28731 21.0562 5.67791 20.9539 6.04061C20.8516 6.33821 20.5726 6.54281 20.275 6.54281Z"
            fill="var(--text-color)"
          />
          <path
            d="M3.32012 19.1636C3.09692 19.1636 2.87372 19.052 2.74352 18.8567C2.52962 18.5405 2.61332 18.1034 2.92952 17.8895L7.51444 14.8112C8.51884 14.1416 9.90454 14.216 10.8159 14.9879L11.1228 15.2576C11.5878 15.6575 12.3783 15.6575 12.8341 15.2576L16.7029 11.9375C17.6887 11.0912 19.2418 11.0912 20.2369 11.9375L21.7528 13.2395C22.0411 13.4906 22.0783 13.9277 21.8272 14.2253C21.5761 14.5136 21.139 14.5508 20.8414 14.2997L19.3255 12.9977C18.8605 12.5978 18.07 12.5978 17.6143 12.9977L13.7455 16.3178C12.7597 17.1641 11.2065 17.1641 10.2114 16.3178L9.90454 16.0481C9.47674 15.6854 8.76994 15.6482 8.29564 15.9737L3.72002 19.052C3.58982 19.1264 3.45032 19.1636 3.32012 19.1636Z"
            fill="var(--text-color)"
          />
        </svg>
      </span>
    </div>
  );
}; /*import NotificationIcon from '../assets/notification.svg?react';*/
